;***************************************************************
;* TMS320C54x C/C++ Codegen                          PC v4.1.0 *
;* Date/Time created: Sat Mar 31 16:55:52 2007                 *
;***************************************************************
	.compiler_opts --mem_model:code=near --mem_model:data=flat --silicon_version=549 
	.mmregs
FP	.set	AR7
	.c_mode

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("snd_dsp.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C54x C/C++ Codegen PC v4.1.0 Copyright (c) 1996-2005 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	1,16
	.field  	_aic23_port+0,16
	.field  	65535,16			; _aic23_port @ 0

	.sect	".cinit"
	.align	1
	.field  	1,16
	.field  	_aic23_dma+0,16
	.field  	65535,16			; _aic23_dma @ 0

	.sect	".cinit"
	.align	1
	.field  	1,16
	.field  	_outBuf+0,16
	.field  	_outBufData,16		; _outBuf @ 0

	.sect	".cinit"
	.align	1
	.field  	1,16
	.field  	_outBuf2+0,16
	.field  	_outBuf2Data,16		; _outBuf2 @ 0

	.sect	".cinit"
	.align	1
	.field  	1,16
	.field  	_outBufSize+0,16
	.field  	0,16			; _outBufSize @ 0

	.sect	".cinit"
	.align	1
	.field  	1,16
	.field  	_outBuf2Size+0,16

	.dwendtag DW$T$44


DW$T$45	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$45, DW_AT_language(DW_LANG_C)

DW$T$48	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
DW$72	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
DW$73	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$74	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$75	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$76	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$47)
DW$77	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$47)
DW$78	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
	.dwendtag DW$T$48


DW$T$49	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$49, DW_AT_language(DW_LANG_C)
DW$79	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$80	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$81	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$9)
DW$82	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$8)
	.dwendtag DW$T$49


DW$T$54	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)
DW$83	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
	.dwendtag DW$T$54

DW$T$8	.dwtag  DW_TAG_base_type, DW_AT_name("short")
	.dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$8, DW_AT_byte_size(0x01)

DW$T$56	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$8)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)
DW$T$9	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$9, DW_AT_byte_size(0x01)
DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)

DW$T$57	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
	.dwattr DW$T$57, DW_AT_language(DW_LANG_C)
DW$84	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
	.dwendtag DW$T$57


DW$T$59	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$58)
	.dwattr DW$T$59, DW_AT_language(DW_LANG_C)
DW$85	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
	.dwendtag DW$T$59


DW$T$60	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$9)
	.dwattr DW$T$60, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$60, DW_AT_byte_size(0x800)
DW$86	.dwtag  DW_TAG_subrange_type
	.dwattr DW$86, DW_AT_upper_bound(0x7ff)
	.dwendtag DW$T$60


DW$T$61	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$9)
	.dwattr DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$61, DW_AT_byte_size(0x1000)
DW$87	.dwtag  DW_TAG_subrange_type
	.dwattr DW$87, DW_AT_upper_bound(0xfff)
	.dwendtag DW$T$61

DW$T$62	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$9)
	.dwattr DW$T$62, DW_AT_address_class(0x10)
DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x01)

DW$T$63	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)

DW$T$65	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$65, DW_AT_language(DW_LANG_C)
DW$88	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
	.dwendtag DW$T$65

DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
DW$T$40	.dwtag  DW_TAG_typedef, DW_AT_name("MCBSP_Handle"), DW_AT_type(*DW$T$39)
	.dwattr DW$T$40, DW_AT_language(DW_LANG_C)

DW$T$94	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$94, DW_AT_language(DW_LANG_C)
DW$T$43	.dwtag  DW_TAG_typedef, DW_AT_name("DMA_Handle"), DW_AT_type(*DW$T$42)
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)

DW$T$98	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$43)
	.dwattr DW$T$98, DW_AT_language(DW_LANG_C)
DW$89	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$90	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$98

DW$T$102	.dwtag  DW_TAG_typedef, DW_AT_name("tDspCom"), DW_AT_type(*DW$T$101)
	.dwattr DW$T$102, DW_AT_language(DW_LANG_C)
DW$T$103	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$102)
	.dwattr DW$T$103, DW_AT_address_class(0x10)
DW$T$53	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$52)
	.dwattr DW$T$53, DW_AT_address_class(0x10)

DW$T$109	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$109, DW_AT_language(DW_LANG_C)
DW$91	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$67)
DW$92	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
	.dwendtag DW$T$109

DW$T$31	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$31, DW_AT_address_class(0x10)
DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("DMA_AdrPtr"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("CSLBool"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x01)
DW$T$39	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$39, DW_AT_address_class(0x10)
DW$T$42	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
	.dwattr DW$T$42, DW_AT_address_class(0x10)
DW$T$101	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$101, DW_AT_type(*DW$T$23)
DW$T$52	.dwtag  DW_TAG_const_type
	.dwattr DW$T$52, DW_AT_type(*DW$T$51)
DW$T$67	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
	.dwattr DW$T$67, DW_AT_address_class(0x10)
DW$T$46	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
	.dwattr DW$T$46, DW_AT_address_class(0x10)

DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_byte_size(0x02)
DW$93	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$93, DW_AT_name("Private"), DW_AT_symbol_name("_Private")
	.dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20


DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_byte_size(0x02)
DW$94	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$94, DW_AT_name("Private"), DW_AT_symbol_name("_Private")
	.dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21


DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$23, DW_AT_byte_size(0x10e)
DW$95	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$95, DW_AT_name("armInitFinished"), DW_AT_symbol_name("_armInitFinished")
	.dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
DW$96	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$96, DW_AT_name("chipNum"), DW_AT_symbol_name("_chipNum")
	.dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
DW$97	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$97, DW_AT_name("dataSampleRate"), DW_AT_symbol_name("_dataSampleRate")
	.dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
DW$98	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$98, DW_AT_name("outputSampleRate"), DW_AT_symbol_name("_outputSampleRate")
	.dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
DW$99	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$99, DW_AT_name("stereo"), DW_AT_symbol_name("_stereo")
	.dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
DW$100	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$100, DW_AT_name("decodeRequest"), DW_AT_symbol_name("_decodeRequest")
	.dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
DW$101	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$101, DW_AT_name("decodeDone"), DW_AT_symbol_name("_decodeDone")
	.dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
DW$102	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$102, DW_AT_name("bufAddr"), DW_AT_symbol_name("_bufAddr")
	.dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
DW$103	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$103, DW_AT_name("bufSize"), DW_AT_symbol_name("_bufSize")
	.dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
DW$104	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$104, DW_AT_name("hasDbgMsg"), DW_AT_symbol_name("_hasDbgMsg")
	.dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
DW$105	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$105, DW_AT_name("dbgMsg"), DW_AT_symbol_name("_dbgMsg")
	.dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$23

DW$T$51	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$51, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$51, DW_AT_byte_size(0x01)

DW$T$22	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
	.dwattr DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$22, DW_AT_byte_size(0xff)
DW$106	.dwtag  DW_TAG_subrange_type
	.dwattr DW$106, DW_AT_upper_bound(0xfe)
	.dwendtag DW$T$22


	.dwattr DW$37, DW_AT_external(0x01)
	.dwattr DW$43, DW_AT_external(0x01)
	.dwattr DW$54, DW_AT_external(0x01)
	.dwattr DW$34, DW_AT_external(0x01)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$107	.dwtag  DW_TAG_assign_register, DW_AT_name("A")
	.dwattr DW$107, DW_AT_location[DW_OP_reg0]
DW$108	.dwtag  DW_TAG_assign_register, DW_AT_name("AH")
	.dwattr DW$108, DW_AT_location[DW_OP_reg1]
DW$109	.dwtag  DW_TAG_assign_register, DW_AT_name("AG")
	.dwattr DW$109, DW_AT_location[DW_OP_reg2]
DW$110	.dwtag  DW_TAG_assign_register, DW_AT_name("")
	.dwattr DW$110, DW_AT_location[DW_OP_reg3]
DW$111	.dwtag  DW_TAG_assign_register, DW_AT_name("")
	.dwattr DW$111, DW_AT_location[DW_OP_reg4]
DW$112	.dwtag  DW_TAG_assign_register, DW_AT_name("")
	.dwattr DW$112, DW_AT_location[DW_OP_reg5]
DW$113	.dwtag  DW_TAG_assign_register, DW_AT_name("B")
	.dwattr DW$113, DW_AT_location[DW_OP_reg6]
DW$114	.dwtag  DW_TAG_assign_register, DW_AT_name("BH")
	.dwattr DW$114, DW_AT_location[DW_OP_reg7]
DW$115	.dwtag  DW_TAG_assign_register, DW_AT_name("BG")
	.dwattr DW$115, DW_AT_location[DW_OP_reg8]
DW$116	.dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
	.dwattr DW$116, DW_AT_location[DW_OP_reg9]
DW$117	.dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
	.dwattr DW$117, DW_AT_location[DW_OP_reg10]
DW$118	.dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
	.dwattr DW$118, DW_AT_location[DW_OP_reg11]
DW$119	.dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
	.dwattr DW$119, DW_AT_location[DW_OP_reg12]
DW$120	.dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
	.dwattr DW$120, DW_AT_location[DW_OP_reg13]
DW$121	.dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
	.dwattr DW$121, DW_AT_location[DW_OP_reg14]
DW$122	.dwtag  DW_TAG_assign_register, DW_AT_name("AR6")
	.dwattr DW$122, DW_AT_location[DW_OP_reg15]
DW$123	.dwtag  DW_TAG_assign_register, DW_AT_name("AR7")
	.dwattr DW$123, DW_AT_location[DW_OP_reg16]
DW$124	.dwtag  DW_TAG_assign_register, DW_AT_name("SP")
	.dwattr DW$124, DW_AT_location[DW_OP_reg17]
DW$125	.dwtag  DW_TAG_assign_register, DW_AT_name("FP")
	.dwattr DW$125, DW_AT_location[DW_OP_reg18]
DW$126	.dwtag  DW_TAG_assign_register, DW_AT_name("BK")
	.dwattr DW$126, DW_AT_location[DW_OP_reg19]
DW$127	.dwtag  DW_TAG_assign_register, DW_AT_name("T")
	.dwattr DW$127, DW_AT_location[DW_OP_reg20]
DW$128	.dwtag  DW_TAG_assign_register, DW_AT_name("ASM")
	.dwattr DW$128, DW_AT_location[DW_OP_reg21]
DW$129	.dwtag  DW_TAG_assign_register, DW_AT_name("SXM")
	.dwattr DW$129, DW_AT_location[DW_OP_reg22]
DW$130	.dwtag  DW_TAG_assign_register, DW_AT_name("ST0")
	.dwattr DW$130, DW_AT_location[DW_OP_reg23]
DW$131	.dwtag  DW_TAG_assign_register, DW_AT_name("ST1")
	.dwattr DW$131, DW_AT_location[DW_OP_reg24]
DW$132	.dwtag  DW_TAG_assign_register, DW_AT_name("BRC")
	.dwattr DW$132, DW_AT_location[DW_OP_reg25]
DW$133	.dwtag  DW_TAG_assign_register, DW_AT_name("TC")
	.dwattr DW$133, DW_AT_location[DW_OP_reg26]
DW$134	.dwtag  DW_TAG_assign_register, DW_AT_name("PC")
	.dwattr DW$134, DW_AT_location[DW_OP_reg27]
DW$135	.dwtag  DW_TAG_assign_register, DW_AT_name("DB")
	.dwattr DW$135, DW_AT_location[DW_OP_reg28]
DW$136	.dwtag  DW_TAG_assign_register, DW_AT_name("PMST")
